pratanczuk/qemu/hw/mips/mips_pic32mx3.c
/*
 * QEMU support for Microchip PIC32MX3 microcontroller.
 *
 * Copyright (c) 2015 Serge Vakulenko
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/* Only 32-bit little endian mode supported. */
#include "config.h"
#if !defined TARGET_MIPS64 && !defined TARGET_WORDS_BIGENDIAN

#include "hw/i386/pc.h"
#include "hw/char/serial.h"
#include "hw/mips/cpudevs.h"
#include "hw/qdev-properties.h"
#include "sysemu/char.h"
#include "hw/loader.h"
#include "qemu/error-report.h"
#include "sysemu/sysemu.h"
#include "hw/empty_slot.h"
#include "elf.h"
#include "qemu/timer.h"
#include <stdlib.h>
#include <termios.h>

#define PIC32MX3
#include "pic32mx.h"
#include "pic32_peripherals.h"
#include "pic32mx3_nvm.h"

/* Hardware addresses */
#define PROGRAM_FLASH_START 0x1d000000
#define BOOT_FLASH_START    0x1fc00000
#define DATA_MEM_START      0x00000000
#define IO_MEM_START        0x1f800000

#define PROGRAM_FLASH_SIZE  (256*1024)          // 256 kbytes
#define BOOT_FLASH_SIZE     (12*1024)           // 12 kbytes
#define DATA_MEM_SIZE       (64*1024)           // 64 kbytes
#define USER_MEM_START      0xbf000000

#define TYPE_MIPS_PIC32     "mips-pic32mx3"

/*
 * Board variants.
 */
enum {
    BOARD_MX350_GENERIC,            /* Generic PIC32MX350F256H board */
};

static const char *board_name[] = {
    "PIC32MX350F256H Generic",
};

/*
 * Pointers to Flash memory contents.
 */
static char *prog_ptr;
static char *boot_ptr;

#define BOOTMEM(addr) ((uint32_t*) boot_ptr) [(addr & 0xffff) >> 2]

/*
 * TODO: add option to enable tracing.
 * IRQ: set QEMU_PIC32_TRACE_IRQ=1 to log each irq_raise() to stderr.
 */
#define TRACE   0

/*
 * PIC32MX350F256H: irq index is the IFS bit position (IFS0: 0–31, IFS1: 32–63,
 * IFS2: 64–95). irq_raise() ORs 1 << irq into the corresponding IFS register.
 */
static const int irq_to_vector[] = {
    /* IFS0 */
    PIC32_VECT_CT,      /* 0 */
    PIC32_VECT_CS0,     /* 1 */
    PIC32_VECT_CS1,     /* 2 */
    PIC32_VECT_INT0,    /* 3 */
    PIC32_VECT_T1,      /* 4 */
    PIC32_VECT_IC1,     /* 5 IC1EIF */
    PIC32_VECT_IC1,     /* 6 IC1IF */
    PIC32_VECT_OC1,     /* 7 */
    PIC32_VECT_INT1,    /* 8 */
    PIC32_VECT_T2,      /* 9 */
    PIC32_VECT_IC2,     /* 10 IC2EIF */
    PIC32_VECT_IC2,     /* 11 IC2IF */
    PIC32_VECT_OC2,     /* 12 */
    PIC32_VECT_INT2,    /* 13 */
    PIC32_VECT_T3,      /* 14 T3IF */
    PIC32_VECT_IC3,     /* 15 IC3EIF */
    PIC32_VECT_IC3,     /* 16 IC3IF */
    PIC32_VECT_OC3,     /* 17 */
    PIC32_VECT_INT3,    /* 18 */
    PIC32_VECT_T4,      /* 19 */
    PIC32_VECT_IC4,     /* 20 IC4EIF */
    PIC32_VECT_IC4,     /* 21 IC4IF */
    PIC32_VECT_OC4,     /* 22 */
    PIC32_VECT_INT4,    /* 23 */
    PIC32_VECT_T5,      /* 24 */
    PIC32_VECT_IC5,     /* 25 IC5EIF */
    PIC32_VECT_IC5,     /* 26 IC5IF */
    PIC32_VECT_OC5,     /* 27 */
    PIC32_VECT_AD1,     /* 28 */
    PIC32_VECT_FSCM,    /* 29 */
    PIC32_VECT_RTCC,    /* 30 */
    PIC32_VECT_FCE,     /* 31 */
    /* IFS1 */
    PIC32_VECT_CMP1,    /* 32 */
    PIC32_VECT_CMP2,    /* 33 */
    -1,                 /* 34 reserved */
    PIC32_VECT_SPI1,    /* 35 SPI1EIF */
    PIC32_VECT_SPI1,    /* 36 SPI1RXIF */
    PIC32_VECT_SPI1,    /* 37 SPI1TXIF */
    PIC32_VECT_U1,      /* 38 U1EIF */
    PIC32_VECT_U1,      /* 39 U1RXIF */
    PIC32_VECT_U1,      /* 40 U1TXIF */
    PIC32_VECT_I2C1,    /* 41 I2C1BIF */
    PIC32_VECT_I2C1,    /* 42 I2C1SIF */
    PIC32_VECT_I2C1,    /* 43 I2C1MIF */
    PIC32_VECT_CN,      /* 44 CNAIF */
    PIC32_VECT_CN,      /* 45 CNBIF */
    PIC32_VECT_CN,      /* 46 CNCIF */
    PIC32_VECT_CN,      /* 47 CNDIF */
    PIC32_VECT_CN,      /* 48 CNEIF */
    PIC32_VECT_CN,      /* 49 CNFIF */
    PIC32_VECT_CN,      /* 50 CNGIF */
    PIC32_VECT_PMP,     /* 51 PMPIF */
    PIC32_VECT_PMP,     /* 52 PMPEIF */
    PIC32_VECT_SPI2,    /* 53 SPI2EIF */
    PIC32_VECT_SPI2,    /* 54 SPI2RXIF */
    PIC32_VECT_SPI2,    /* 55 SPI2TXIF */
    PIC32_VECT_U2,      /* 56 U2EIF */
    PIC32_VECT_U2,      /* 57 U2RXIF */
    PIC32_VECT_U2,      /* 58 U2TXIF */
    PIC32_VECT_I2C2,    /* 59 I2C2BIF */
    PIC32_VECT_I2C2,    /* 60 I2C2SIF */
    PIC32_VECT_I2C2,    /* 61 I2C2MIF */
    PIC32_VECT_U3,      /* 62 U3EIF */
    PIC32_VECT_U3,      /* 63 U3RXIF */
    /* IFS2 (MX350 subset) */
    PIC32_VECT_U3,      /* 64 U3TXIF */
    PIC32_VECT_U4,      /* 65 U4EIF */
    PIC32_VECT_U4,      /* 66 U4RXIF */
    PIC32_VECT_U4,      /* 67 U4TXIF */
    -1,                 /* 68 */
    -1,                 /* 69 */
    -1,                 /* 70 */
    -1,                 /* 71 CTMUIF (no vect in pic32mx.h) */
    PIC32_VECT_DMA0,    /* 72 DMA0IF */
    PIC32_VECT_DMA1,    /* 73 DMA1IF */
    PIC32_VECT_DMA2,    /* 74 DMA2IF */
    PIC32_VECT_DMA3,    /* 75 DMA3IF */
};

static void update_irq_status(pic32_t *s)
{
    /* Assume no interrupts pending. */
    int cause_ripl = 0;
    int vector = 0;
    CPUMIPSState *env = &s->cpu->env;
    int current_ripl = (env->CP0_Cause >> (CP0Ca_IP + 2)) & 0x3f;

