pratanczuk/qemu/hw/mips/mips_pic32mx3.c
    VALUE(INTSTAT) = 0;

    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2)))
    {
        /* Find the most prioritized pending interrupt,
         * it's vector and level. */
        int irq;
        for (irq=0; irq<sizeof(irq_to_vector)/sizeof(int); irq++) {
            int n = irq >> 5;

            if (((VALUE(IFS(n)) & VALUE(IEC(n))) >> (irq & 31)) & 1) {
                /* Interrupt is pending. */
                int v = irq_to_vector [irq];
                if (v < 0)
                    continue;

                /*
                 * Priority/subpriority live in IPC(irq/4), field (irq mod 4).
                 * Do not use IPC(vector/4): e.g. UART3 IRQs 37–39 use IPC9 while
                 * vector 31 would incorrectly use IPC7 (RIPL stays 0, VEIC never
                 * delivers).
                 */
                int level = VALUE(IPC(irq >> 2));
                level >>= 2 + (irq & 3) * 8;
                level &= 7;
                if (level > cause_ripl) {
                    vector = v;
                    cause_ripl = level;
                }
            }
        }
        VALUE(INTSTAT) = vector | (cause_ripl << 8);
        env->eic_vector = vector & 0xff;
    } else {
        env->eic_vector = 0;
    }

    if (TRACE)
        fprintf(qemu_logfile, "--- Priority level Cause.RIPL = %u\n",
            cause_ripl);

    /*
     * Modify Cause.RIPL field and take EIC interrupt.
     */
    env->CP0_Cause &= ~(0x3f << (CP0Ca_IP + 2));
    env->CP0_Cause |= cause_ripl << (CP0Ca_IP + 2);
    /*
     * Always poke the CPU when any enabled interrupt is pending. Omitting
     * cpu_interrupt when Cause.RIPL was unchanged left guest tight loops
     * (e.g. a firmware busy-wait delay_ms) spinning in one TB while the T3 tick ISR
     * never ran.
     */
    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2))) {
        cpu_interrupt(CPU(s->cpu), CPU_INTERRUPT_HARD);
    } else if (cause_ripl != current_ripl) {
        cpu_interrupt(CPU(s->cpu), CPU_INTERRUPT_HARD);
    }
}

/*
 * Decode IFS bit index for debug (set QEMU_PIC32_TRACE_IRQ=1).
 */
static const char *pic32mx3_irq_name(int irq)
{
    switch (irq) {
    case 0: return "CT";
    case 4: return "T1IF";
    case 6: return "IC1IF";
    case 7: return "OC1IF";
    case 9: return "T2IF";
    case 12: return "OC2IF";
    case 17: return "OC3IF";
    case 22: return "OC4IF";
    case 14: return "T3IF";
    case 19: return "T4IF";
    case 24: return "T5IF";
    case 28: return "U1TXIF";
    case 32: return "CNIF";
    case 33: return "AD1IF";
    case 43: return "I2C2MIF";
    case 51: return "PMPIF";
    case 56: return "U2TXIF";
    case 62: return "U3EIF";
    case 63: return "U3RXIF";
    case 64: return "U3TXIF";
    default: return "?";
    }
}

/*
 * Set interrupt flag status
 */
static void irq_raise(pic32_t *s, int irq)
{
    if (getenv("QEMU_PIC32_TRACE_IRQ")) {
        CPUMIPSState *env = &s->cpu->env;
        int m = irq >> 5;
        int b = irq & 31;
        uint32_t iec = m == 0 ? VALUE(IEC0) : (m == 1 ? VALUE(IEC1) : VALUE(IEC2));

        fprintf(stderr,
                "pic32mx3 irq_raise %s(%d) PC=0x%08x IFS&IEC[%d]=%d "
                "IFS0=%08x IFS1=%08x IFS2=%08x IEC0=%08x IEC1=%08x IEC2=%08x\n",
                pic32mx3_irq_name(irq), irq, (unsigned)env->active_tc.PC, irq,
                (int)((iec >> b) & 1u), VALUE(IFS0), VALUE(IFS1), VALUE(IFS2),
                VALUE(IEC0), VALUE(IEC1), VALUE(IEC2));
    }
    VALUE(IFS(irq >> 5)) |= 1u << (irq & 31);
    update_irq_status(s);
}

/*
 * Clear interrupt flag status
 */
static void irq_clear(pic32_t *s, int irq)
{
    if (! (VALUE(IFS(irq >> 5)) & (1 << (irq & 31))))
        return;

    VALUE(IFS(irq >> 5)) &= ~(1 << (irq & 31));
    update_irq_status(s);
}

/*
 * Timer interrupt.
 */
static void pic32_timer_irq(CPUMIPSState *env, int raise)
{
    pic32_t *s = env->eic_context;

    if (raise) {
        if (TRACE)
            fprintf(qemu_logfile, "--- %08x: Timer interrupt\n",
                env->active_tc.PC);
        irq_raise(s, 0);
    } else {
        if (TRACE)
            fprintf(qemu_logfile, "--- Clear timer interrupt\n");
        irq_clear(s, 0);
    }
}

/*
 * Software interrupt.
 */
static void pic32_soft_irq(CPUMIPSState *env, int num)
{
    pic32_t *s = env->eic_context;

    if (TRACE)
        fprintf(qemu_logfile, "--- %08x: Soft interrupt %u\n",
            env->active_tc.PC, num);
    irq_raise(s, num + 1);
}

/* PBCLK for PIC32MX350 generic board (matches DEVCFG / cpu_mips_clock_init). */
#define PIC32MX3_PBCLK_HZ 80000000ull

/*
 * T1–T5 period match uses the same PBCLK-derived nanosecond period.
 * With -icount, use VIRTUAL_RT so polled TxIF sees wall-time progress (see T3).
 */
static inline QEMUClockType pic32mx3_tmr3_clock_type(void)
{
    return use_icount ? QEMU_CLOCK_VIRTUAL_RT : QEMU_CLOCK_VIRTUAL;
}

static inline int64_t pic32mx3_tmr3_clock_get_ns(void)
{
    return qemu_clock_get_ns(pic32mx3_tmr3_clock_type());
}

/* IFS bit indices for T1IF..T5IF on PIC32MX350 (matches irq_to_vector[]). */
static const uint8_t pic32mx3_tmr_ifs_irq[PIC32_MX3_N_TMRS] = { 4, 9, 14, 19, 24 };

static uint64_t pic32mx3_typeb_period_ns(uint32_t tcon, uint32_t pr)
{
    unsigned tckps = (tcon >> 4) & 7u;
    static const uint32_t prescale8[8] = { 1, 2, 4, 8, 16, 32, 64, 256 };
    uint64_t pre = prescale8[tckps];
    uint64_t ticks = (uint64_t)(pr + 1u) * pre;

    if (ticks == 0) {
        return 1000000ull;
    }
    return (ticks * 1000000000ull) / PIC32MX3_PBCLK_HZ;
}

static uint64_t pic32mx3_tmr_period_ns(pic32_t *s, int idx)
{
    uint32_t tcon, pr;

    switch (idx) {
    case 0:                     /* T1 Type A */
        tcon = VALUE(T1CON);
        pr = (uint16_t)VALUE(PR1);
        if (tcon & (1u << 1)) { /* TCS external clock — stub */
            return 1000000000ull;
        }
        {
            unsigned tckps = (tcon >> 4) & 3u;
            static const uint32_t prescale4[4] = { 1, 8, 64, 256 };
            uint64_t pre = prescale4[tckps];
            uint64_t ticks = (uint64_t)(pr + 1u) * pre;

            if (ticks == 0) {
                return 1000000ull;
            }
            return (ticks * 1000000000ull) / PIC32MX3_PBCLK_HZ;
        }
    case 1:
        return pic32mx3_typeb_period_ns(VALUE(T2CON), (uint16_t)VALUE(PR2));
    case 2:
        return pic32mx3_typeb_period_ns(VALUE(T3CON), (uint16_t)VALUE(PR3));
    case 3:
        return pic32mx3_typeb_period_ns(VALUE(T4CON), (uint16_t)VALUE(PR4));
    case 4:
        return pic32mx3_typeb_period_ns(VALUE(T5CON), (uint16_t)VALUE(PR5));
    default:
        return 1000000ull;
    }
}

static void pic32mx3_tmr_recompute(pic32_t *s, int idx);
static void pic32mx3_tmrs_recompute_all(pic32_t *s);

