pratanczuk/qemu/hw/mips/mips_pic32mx3.c
/*
 * Output compare (minimal): OCxIF when the selected time base wraps.  OCTSEL
 * bit 3: 0 = Timer2 (tmr idx 1), 1 = Timer3 (tmr idx 2).  Any non-zero OCM
 * enables the pulse.  Pin/compare value accuracy is not modeled (uart-cli).
 */
static void pic32mx3_oc_raise_for_timer(pic32_t *s, int tmr_idx)
{
    static const uint32_t oc_con[5] = {
        OC1CON, OC2CON, OC3CON, OC4CON, OC5CON
    };
    static const int oc_irq[5] = { 7, 12, 17, 22, 27 };
    int i;

    if (tmr_idx != 1 && tmr_idx != 2) {
        return;
    }
    for (i = 0; i < 5; i++) {
        unsigned con = VALUE(oc_con[i]);
        unsigned ocm = con & 7u;

        if (ocm == 0u) {
            continue;
        }
        if (((con >> 3) & 1u) != (unsigned)(tmr_idx - 1)) {
            continue;
        }
        irq_raise(s, oc_irq[i]);
    }
}

static void pic32mx3_tmr_cb(void *opaque)
{
    Pic32Mx3TmrOpaque *o = opaque;
    pic32_t *s = o->mcu;
    int idx = o->idx;

    switch (idx) {
    case 0:
        if (!(VALUE(T1CON) & 0x8000u)) {
            return;
        }
        VALUE(TMR1) = 0;
        break;
    case 1:
        if (!(VALUE(T2CON) & 0x8000u)) {
            return;
        }
        VALUE(TMR2) = 0;
        break;
    case 2:
        if (!(VALUE(T3CON) & 0x8000u)) {
            return;
        }
        VALUE(TMR3) = 0;
        break;
    case 3:
        if (!(VALUE(T4CON) & 0x8000u)) {
            return;
        }
        VALUE(TMR4) = 0;
        break;
    case 4:
        if (!(VALUE(T5CON) & 0x8000u)) {
            return;
        }
        VALUE(TMR5) = 0;
        break;
    default:
        return;
    }
    irq_raise(s, pic32mx3_tmr_ifs_irq[idx]);
    pic32mx3_oc_raise_for_timer(s, idx);
    pic32mx3_tmr_recompute(s, idx);
}

static void pic32mx3_tmr_recompute(pic32_t *s, int idx)
{
    uint32_t tcon;

    if (idx < 0 || idx >= PIC32_MX3_N_TMRS || !s->tmr_timer[idx]) {
        return;
    }
    switch (idx) {
    case 0: tcon = VALUE(T1CON); break;
    case 1: tcon = VALUE(T2CON); break;
    case 2: tcon = VALUE(T3CON); break;
    case 3: tcon = VALUE(T4CON); break;
    case 4: tcon = VALUE(T5CON); break;
    default:
        return;
    }
    if (!(tcon & 0x8000u)) {
        timer_del(s->tmr_timer[idx]);
        return;
    }
    {
        uint64_t per = pic32mx3_tmr_period_ns(s, idx);

        if (per < 1000ull) {
            per = 1000ull;
        }
        timer_mod(s->tmr_timer[idx],
                  pic32mx3_tmr3_clock_get_ns() + per);
    }
}

static void pic32mx3_tmrs_recompute_all(pic32_t *s)
{
    int i;

    for (i = 0; i < PIC32_MX3_N_TMRS; i++) {
        pic32mx3_tmr_recompute(s, i);
    }
}

/*
 * Perform an assign/clear/set/invert operation.
 */
static inline unsigned write_op(int a, int b, int op)
{
    switch (op & 0xc) {
    case 0x0: a = b;   break;   // Assign
    case 0x4: a &= ~b; break;   // Clear
    case 0x8: a |= b;  break;   // Set
    case 0xc: a ^= b;  break;   // Invert
    }
    return a;
}

/*
 * PIC32MX350F256H maps ports B–G with ANSEL and per-port change-notification
 * registers every 0x100 bytes starting at 0xBF886100 (physical offset 0x86100).
 * See Microchip p32mx350f256h.h — distinct from the compact map used for MX7.
 */
#define MX350_PORT0       0x86100
#define MX350_PORT_STRIDE 0x100
#define MX350_NPORTS      6

static inline int mx350_port_index(unsigned offset)
{
    if (offset < MX350_PORT0) {
        return -1;
    }
    offset -= MX350_PORT0;
    if (offset >= MX350_NPORTS * MX350_PORT_STRIDE) {
        return -1;
    }
    return (int) (offset / MX350_PORT_STRIDE);
}

static void mx350_port_write(pic32_t *s, unsigned offset, unsigned data)
{
    int port = mx350_port_index(offset);
    unsigned base = MX350_PORT0 + (unsigned) port * MX350_PORT_STRIDE;
    unsigned reg = offset - base;
    unsigned lat_word = base + 0x30;

    if (reg >= 0x20 && reg <= 0x2c) {
        s->iomem[lat_word >> 2] = write_op(s->iomem[lat_word >> 2], data, offset);
        pic32_gpio_write(s, port, s->iomem[lat_word >> 2]);
        return;
    }
    if (reg >= 0x30 && reg <= 0x3c) {
        s->iomem[lat_word >> 2] = write_op(s->iomem[lat_word >> 2], data, offset);
        pic32_gpio_write(s, port, s->iomem[lat_word >> 2]);
        return;
    }
    s->iomem[offset >> 2] = write_op(s->iomem[offset >> 2], data, offset);
}

/* Peripheral Pin Select (input + output), PIC32MX350 — see p32mx350f256h.h ~0xBF80FA00–0xBF80FCAF */
#define MX350_PPS_FIRST 0xfa00
#define MX350_PPS_LAST  0xfcff

static inline int mx350_pps_offset(unsigned offset)
{
    return offset >= MX350_PPS_FIRST && offset <= MX350_PPS_LAST;
}

static void mx350_pps_write(pic32_t *s, unsigned offset, unsigned data)
{
    s->iomem[offset >> 2] = write_op(s->iomem[offset >> 2], data, offset);
}

static void io_reset(pic32_t *s)
{
    int i;

    /*
     * Bus matrix control registers.
     */
    VALUE(BMXCON)    = 0x001f0041;      // Bus Matrix Control
    VALUE(BMXDKPBA)  = 0;               // Data RAM kernel program base address
    VALUE(BMXDUDBA)  = 0;               // Data RAM user data base address
    VALUE(BMXDUPBA)  = 0;               // Data RAM user program base address
    VALUE(BMXPUPBA)  = 0;               // Program Flash user program base address
    VALUE(BMXDRMSZ)  = 64 * 1024;       // Data RAM memory size: 64 KB
    VALUE(BMXPFMSZ)  = 256 * 1024;      // Program Flash memory size: 256 KB
    VALUE(BMXBOOTSZ) = 12 * 1024;       // Boot Flash size: 12 KB

    /*
     * Prefetch controller.
     */
    VALUE(CHECON) = 0x00000007;

    /*
     * System controller.
     */
    VALUE(OSCTUN) = 0;
    VALUE(DDPCON) = 0;
    VALUE(SYSKEY) = 0;
    VALUE(REFOCON) = 0;
    VALUE(REFOTRIM) = 0;
    VALUE(CFGCON) = 0;
    VALUE(RCON)   = 0;
    VALUE(RSWRST) = 0;
    s->syskey_unlock = 0;

    /*
     * Analog to digital converter.
     */
    VALUE(AD1CON1) = 0;                 // Control register 1
    VALUE(AD1CON2) = 0;                 // Control register 2
    VALUE(AD1CON3) = 0;                 // Control register 3
    VALUE(AD1CHS)  = 0;                 // Channel select
    VALUE(AD1CSSL) = 0;                 // Input scan selection
    VALUE(AD1PCFG) = 0;                 // Port configuration
    for (int i = 0; i < 16; i++) {
        VALUE((ADC1BUF0 + i * 0x10)) = 0;
    }

