pratanczuk/qemu/hw/mips/mips_pic32mx3.c
    /*
     * General purpose IO signals.
     * All pins are inputs, high, open drains and pullups disabled.
     * No interrupts on change.
     * Note: Port A is not available on the 64-pin TQFP package.
     */
    VALUE(TRISB) = 0xFFFF;              // Port B: mask of inputs
    VALUE(PORTB) = 0xFFFF;              // Port B: read inputs, write outputs
    VALUE(LATB)  = 0xFFFF;              // Port B: read/write outputs
    VALUE(ODCB)  = 0;                   // Port B: open drain configuration
    VALUE(TRISC) = 0xFFFF;              // Port C: mask of inputs
    VALUE(PORTC) = 0xFFFF;              // Port C: read inputs, write outputs
    VALUE(LATC)  = 0xFFFF;              // Port C: read/write outputs
    VALUE(ODCC)  = 0;                   // Port C: open drain configuration
    VALUE(TRISD) = 0xFFFF;              // Port D: mask of inputs
    VALUE(PORTD) = 0xFFFF;              // Port D: read inputs, write outputs
    VALUE(LATD)  = 0xFFFF;              // Port D: read/write outputs
    VALUE(ODCD)  = 0;                   // Port D: open drain configuration
    VALUE(TRISE) = 0xFFFF;              // Port E: mask of inputs
    VALUE(PORTE) = 0xFFFF;              // Port E: read inputs, write outputs
    VALUE(LATE)  = 0xFFFF;              // Port E: read/write outputs
    VALUE(ODCE)  = 0;                   // Port E: open drain configuration
    VALUE(TRISF) = 0xFFFF;              // Port F: mask of inputs
    VALUE(PORTF) = 0xFFFF;              // Port F: read inputs, write outputs
    VALUE(LATF)  = 0xFFFF;              // Port F: read/write outputs
    VALUE(ODCF)  = 0;                   // Port F: open drain configuration
    VALUE(TRISG) = 0xFFFF;              // Port G: mask of inputs
    VALUE(PORTG) = 0xFFFF;              // Port G: read inputs, write outputs
    VALUE(LATG)  = 0xFFFF;              // Port G: read/write outputs
    VALUE(ODCG)  = 0;                   // Port G: open drain configuration
    VALUE(CNCON) = 0;                   // Interrupt-on-change control
    VALUE(CNEN)  = 0;                   // Input change interrupt enable
    VALUE(CNPUE) = 0;                   // Input pin pull-up enable

    /* MX350 expanded GPIO (ANSEL/CN per port) at Microchip addresses. */
    for (int p = 0; p < MX350_NPORTS; p++) {
        unsigned b = MX350_PORT0 + p * MX350_PORT_STRIDE;

        s->iomem[(b + 0x00) >> 2] = 0;
        s->iomem[(b + 0x10) >> 2] = 0xFFFF; /* TRIS */
        s->iomem[(b + 0x20) >> 2] = 0xFFFF; /* PORT */
        s->iomem[(b + 0x30) >> 2] = 0xFFFF; /* LAT */
        s->iomem[(b + 0x40) >> 2] = 0;      /* ODC */
        s->iomem[(b + 0x50) >> 2] = 0;      /* CNPU */
        s->iomem[(b + 0x60) >> 2] = 0;      /* CNPD */
        s->iomem[(b + 0x70) >> 2] = 0;      /* CNCON */
        s->iomem[(b + 0x80) >> 2] = 0;      /* CNEN */
        s->iomem[(b + 0x90) >> 2] = 0;      /* CNSTAT */
    }

    /*
     * Reset UARTs. MX350F256H: U1, U2, U3 (host -serial stdio is wired to U3).
     */
    VALUE(U1MODE)  = 0;
    VALUE(U1STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U1TXREG) = 0;
    VALUE(U1RXREG) = 0;
    VALUE(U1BRG)   = 0;
    VALUE(U2MODE)  = 0;
    VALUE(U2STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U2TXREG) = 0;
    VALUE(U2RXREG) = 0;
    VALUE(U2BRG)   = 0;
    VALUE(U3MODE)  = 0;
    VALUE(U3STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U3TXREG) = 0;
    VALUE(U3RXREG) = 0;
    VALUE(U3BRG)   = 0;

    /*
     * Reset SPI. MX350F256H has SPI1, SPI2, SPI3.
     */
    VALUE(SPI1CON)  = 0;
    VALUE(SPI1STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI1BRG)  = 0;

    VALUE(SPI2CON)  = 0;
    VALUE(SPI2STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI2BRG)  = 0;

    VALUE(SPI3CON)  = 0;
    VALUE(SPI3STAT) = PIC32_SPISTAT_SPITBE;     // Transmit buffer is empty
    VALUE(SPI3BRG)  = 0;

    for (i=0; i<NUM_SPI; i++) {
        s->spi[i].rfifo = 0;
        s->spi[i].wfifo = 0;
    }

    /*
     * Reset Watchdog timer.
     */
    VALUE(WDTCON) = 0;

    /*
     * Reset NVM controller (idle).
     */
    VALUE(NVMCON) = 0;
    VALUE(NVMKEY) = 0;
    VALUE(NVMADDR) = 0;
    VALUE(NVMDATA) = 0;
    VALUE(NVMSRCADDR) = 0;
    pic32mx3_nvm_reset(s);

    /*
     * Reset Comparator voltage reference.
     */
    VALUE(CVRCON) = 0;

    /*
     * Reset Comparators.
     */
    VALUE(CM1CON) = 0;
    VALUE(CM2CON) = 0;
    VALUE(CM3CON) = 0;
    VALUE(CMSTAT) = 0;

    /*
     * Reset Real-Time Clock and Calendar.
     */
    VALUE(RTCCON)   = 0;
    VALUE(RTCALRM)  = 0;
    VALUE(RTCTIME)  = 0;
    VALUE(RTCDATE)  = 0;
    VALUE(ALRMTIME) = 0;
    VALUE(ALRMDATE) = 0;

    /*
     * Reset Timers T1-T5.
     */
    VALUE(T1CON) = 0;
    VALUE(TMR1)  = 0;
    VALUE(PR1)   = 0xFFFF;

    VALUE(T2CON) = 0;
    VALUE(TMR2)  = 0;
    VALUE(PR2)   = 0xFFFF;

    VALUE(T3CON) = 0;
    VALUE(TMR3)  = 0;
    VALUE(PR3)   = 0xFFFF;

    VALUE(T4CON) = 0;
    VALUE(TMR4)  = 0;
    VALUE(PR4)   = 0xFFFF;

    VALUE(T5CON) = 0;
    VALUE(TMR5)  = 0;
    VALUE(PR5)   = 0xFFFF;

    pic32mx3_tmrs_recompute_all(s);

    /*
     * Reset Input Capture IC1-IC5.
     */
    VALUE(IC1CON) = 0;
    VALUE(IC1BUF) = 0;
    VALUE(IC2CON) = 0;
    VALUE(IC3CON) = 0;
    VALUE(IC4CON) = 0;
    VALUE(IC5CON) = 0;

    /*
     * Reset Output Compare OC1-OC5.
     */
    VALUE(OC1CON) = 0;  VALUE(OC1R) = 0;  VALUE(OC1RS) = 0;
    VALUE(OC2CON) = 0;  VALUE(OC2R) = 0;  VALUE(OC2RS) = 0;
    VALUE(OC3CON) = 0;  VALUE(OC3R) = 0;  VALUE(OC3RS) = 0;
    VALUE(OC4CON) = 0;  VALUE(OC4R) = 0;  VALUE(OC4RS) = 0;
    VALUE(OC5CON) = 0;  VALUE(OC5R) = 0;  VALUE(OC5RS) = 0;

    /*
     * Reset I2C modules I2C1 and I2C2.
     */
    VALUE(I2C1CON)  = 0;
    VALUE(I2C1STAT) = 0;
    VALUE(I2C1ADD)  = 0;
    VALUE(I2C1MSK)  = 0;
    VALUE(I2C1BRG)  = 0;
    VALUE(I2C1TRN)  = 0xFF;
    VALUE(I2C1RCV)  = 0;

    VALUE(I2C2CON)  = 0;
    VALUE(I2C2STAT) = 0;
    VALUE(I2C2ADD)  = 0;
    VALUE(I2C2MSK)  = 0;
    VALUE(I2C2BRG)  = 0;
    VALUE(I2C2TRN)  = 0xFF;
    VALUE(I2C2RCV)  = 0;

