pratanczuk/qemu/hw/mips/mips_pic32mx3.c
/*
 * Minimal ADC1 model for pic32mx3-generic: manual conversion when SAMP goes 1->0
 * with ADON set. Fills ADC1BUF0 with a deterministic 10-bit pattern per CH0SA
 * (guest-visible; uart-cli "adc all" regression).
 */
#define AD1CON1_DONE  0x00000001u
#define AD1CON1_SAMP  0x00000002u
#define AD1CON1_ADON  0x00008000u

static void pic32mx3_adc_after_ad1con1_write(pic32_t *s, unsigned prev, unsigned newv)
{
    if (!(newv & AD1CON1_ADON)) {
        return;
    }
    /* Begin sampling: clear DONE (matches silicon when SAMP is set). */
    if (!(prev & AD1CON1_SAMP) && (newv & AD1CON1_SAMP)) {
        VALUE(AD1CON1) = newv & ~AD1CON1_DONE;
        return;
    }
    /* End sampling -> conversion done (instant in QEMU). */
    if ((prev & AD1CON1_SAMP) && !(newv & AD1CON1_SAMP)) {
        unsigned ch = (VALUE(AD1CHS) >> 16) & 0x1fu;
        unsigned res = (ch * 67u + 11u) & 0x3ffu;

        VALUE(ADC1BUF0) = res;
        VALUE(AD1CON1) = newv | AD1CON1_DONE;
        irq_raise(s, 28); /* IFS0 AD1IF */
    }
}

/*
 * Parallel Master Port (stub): a PMDOUT write with PMP enabled and master mode
 * 1/2 completes immediately — PMDIN gets a deterministic XOR pattern, BUSY
 * clears, and PMPIF is raised if IRQM requests interrupt-on-cycle-end.
 */
static void pic32mx3_pmp_after_pmdout_write(pic32_t *s)
{
    unsigned pmc = VALUE(PMCON);
    unsigned pmm = VALUE(PMMODE);
    unsigned dout;
    unsigned mode = pmm & PIC32_PMMODE_MODE;

    if ((pmc & PIC32_PMCON_ON) == 0) {
        return;
    }
    if (mode != PIC32_PMMODE_MODE_MAST1 && mode != PIC32_PMMODE_MODE_MAST2) {
        return;
    }
    dout = VALUE(PMDOUT) & 0xffffu;
    if (pmm & PIC32_PMMODE_MODE16) {
        VALUE(PMDIN) = dout ^ 0xa5a5u;
    } else {
        VALUE(PMDIN) = (dout & 0xffu) ^ 0x5au;
    }
    VALUE(PMMODE) &= ~PIC32_PMMODE_BUSY;
    if (pmm & PIC32_PMMODE_IRQM_END) {
        irq_raise(s, 51); /* IFS1 PMPIF */
    }
}

/* IC1: ON + non-zero ICM — instant capture from TMR2/TMR3 (ICTMR), IC1IF (IFS0 bit 6). */
#define IC1CON_ON       0x8000u
#define IC1CON_ICM_M    0x0007u
#define IC1CON_ICTMR    0x0080u

static void pic32mx3_ic1con_after_write(pic32_t *s, unsigned newv)
{
    unsigned icm = newv & IC1CON_ICM_M;

    if (!(newv & IC1CON_ON) || icm == 0) {
        return;
    }
    {
        unsigned tmr = (newv & IC1CON_ICTMR) ? VALUE(TMR3) : VALUE(TMR2);

        VALUE(IC1BUF) = tmr & 0xffffu;
    }
    irq_raise(s, 6); /* IC1IF */
}

static void pic32mx3_cm1con_after_write(pic32_t *s)
{
    if (VALUE(CM1CON) & 0x8000u) {
        VALUE(CMSTAT) |= 1u; /* C1OUT */
        irq_raise(s, 32);    /* IFS1 CMP1IF */
    } else {
        VALUE(CMSTAT) &= ~1u;
    }
}

static void pic32mx3_cm2con_after_write(pic32_t *s)
{
    if (VALUE(CM2CON) & 0x8000u) {
        VALUE(CMSTAT) |= 2u; /* C2OUT */
        irq_raise(s, 33);    /* IFS1 CMP2IF */
    } else {
        VALUE(CMSTAT) &= ~2u;
    }
}

/* I2C TRN write with I2CxCON ON: loopback into RCV + master IF (IFS1 43 / 61). */
static void pic32mx3_i2c_trn_write(pic32_t *s, int port, unsigned data)
{
    unsigned con = port == 0 ? VALUE(I2C1CON) : VALUE(I2C2CON);
    unsigned xorv = port == 0 ? 0xaaU : 0x55U;
    unsigned b = data & 0xffu;

    if (!(con & 0x8000u)) {
        return;
    }
    if (port == 0) {
        VALUE(I2C1RCV) = b ^ xorv;
        irq_raise(s, 43);
    } else {
        VALUE(I2C2RCV) = b ^ xorv;
        irq_raise(s, 61);
    }
}

static void io_write32(pic32_t *s, unsigned offset, unsigned data, const char **namep)
{
    unsigned *bufp = &VALUE(offset);

    if (mx350_port_index(offset) >= 0) {
        *namep = "mx350.gpio";
        mx350_port_write(s, offset, data);
        return;
    }
    if (mx350_pps_offset(offset)) {
        *namep = "mx350.pps";
        mx350_pps_write(s, offset, data);
        return;
    }

    if (offset >= 0xf270 && offset < 0xf600) {
        *namep = "mx350.sysstub";
        s->iomem[offset >> 2] = write_op(s->iomem[offset >> 2], data, offset);
        return;
    }

    switch (offset) {
    /*-------------------------------------------------------------------------
     * Bus matrix control registers.
     */
    WRITEOP(BMXCON); return;    // Bus Matrix Control
    STORAGE(BMXDKPBA); break;   // Data RAM kernel program base address
    STORAGE(BMXDUDBA); break;   // Data RAM user data base address
    STORAGE(BMXDUPBA); break;   // Data RAM user program base address
    STORAGE(BMXPUPBA); break;   // Program Flash user program base address
    READONLY(BMXDRMSZ);         // Data RAM memory size
    READONLY(BMXPFMSZ);         // Program Flash memory size
    READONLY(BMXBOOTSZ);        // Boot Flash size

    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    case INTCON:
    case INTCON + 4:
    case INTCON + 8:
    case INTCON + 12:
        *namep = "INTCON";
        VALUE(INTCON) = write_op(VALUE(INTCON), data, offset);
        s->cpu->env.eic_multivec = (VALUE(INTCON) & PIC32_INTCON_MVEC) != 0;
        return;
    READONLY(INTSTAT);          // Interrupt Status
    WRITEOP(IPTMR);  return;    // Temporal Proximity Timer
    WRITEOP(IFS0); goto irq;    // IFS(0..2) - Interrupt Flag Status
    WRITEOP(IFS1); goto irq;
    WRITEOP(IFS2); goto irq;
    WRITEOP(IEC0); goto irq;    // IEC(0..2) - Interrupt Enable Control
    case IEC1:
    case IEC1 + 4:              /* CLR */
    case IEC1 + 8:              /* SET */
    case IEC1 + 12:             /* INV */
        *namep = "IEC1";
        {
            uint32_t prev = VALUE(IEC1);
            VALUE(IEC1) = write_op(prev, data, offset);
            {
                uint32_t nw = VALUE(IEC1);

                pic32_uart_on_tx_ie_enabled(s, 0, prev, nw);
                pic32_uart_on_tx_ie_enabled(s, 1, prev, nw);
            }
        }
        goto irq;
    case IEC2:
    case IEC2 + 4:              /* CLR */
    case IEC2 + 8:              /* SET */
    case IEC2 + 12:             /* INV */
        *namep = "IEC2";
        {
            uint32_t prev = VALUE(IEC2);
            VALUE(IEC2) = write_op(prev, data, offset);
            pic32_uart_on_tx_ie_enabled(s, 2, prev, VALUE(IEC2));
        }
        goto irq;
    WRITEOP(IPC0); goto irq;    // IPC(0..11) - Interrupt Priority Control
    WRITEOP(IPC1); goto irq;
    WRITEOP(IPC2); goto irq;
    WRITEOP(IPC3); goto irq;
    WRITEOP(IPC4); goto irq;
    WRITEOP(IPC5); goto irq;
    WRITEOP(IPC6); goto irq;
    WRITEOP(IPC7); goto irq;
    WRITEOP(IPC8); goto irq;
    WRITEOP(IPC9); goto irq;
    WRITEOP(IPC10); goto irq;
    WRITEOP(IPC11); goto irq;
    WRITEOP(IPC12);
irq:    pic32mx3_tmrs_recompute_all(s);
        update_irq_status(s);
        return;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    WRITEOP(CHECON); return;    // Prefetch Control

    /*-------------------------------------------------------------------------
     * System controller.
     */
    WRITEOPR(OSCCON, PIC32_OSCCON_UNUSED); break; // Oscillator Control
    WRITEOPR(OSCTUN, PIC32_OSCTUN_UNUSED); break; // Oscillator Tuning
    STORAGE(DDPCON); break;     // Debug Data Port Control
    READONLY(DEVID);            // Device Identifier
    STORAGE(SYSKEY);            // System Key
        /* Unlock state machine: compare the write data (register is old until *bufp). */
        if (data == 0) {
            s->syskey_unlock = 0;
        } else if (s->syskey_unlock == 0 && data == 0xaa996655) {
            s->syskey_unlock = 1;
        } else if (s->syskey_unlock == 1 && data == 0x556699aa) {
            s->syskey_unlock = 2;
        } else {
            s->syskey_unlock = 0;
        }
        break;
    WRITEOP(REFOCON); return;       /* Reference clock output (stub) */
    WRITEOP(REFOTRIM); return;
    WRITEOP(CFGCON); return;        /* Configuration control (stub) */
    WRITEOPR(RCON, PIC32_RCON_UNUSED); break;       // Reset Control
    WRITEOP(RSWRST);            // Software Reset
        if (s->syskey_unlock == 2 && (VALUE(RSWRST) & 1)) {
            /* Reset CPU. */
            qemu_system_reset_request();

