pratanczuk/qemu/hw/mips/mips_pic32mx3.c
            newc = pic32mx3_nvm_nvmcon_write(s, oldc, newc);
            VALUE(NVMCON) = newc;
        }
        return;

    /*-------------------------------------------------------------------------
     * Comparator voltage reference.
     */
    WRITEOP(CVRCON); return;

    /*-------------------------------------------------------------------------
     * Comparators.
     */
    case CM1CON:
    case CM1CONCLR:
    case CM1CONSET:
    case CM1CONINV:
        *namep = "CM1CON";
        VALUE(CM1CON) = write_op(VALUE(CM1CON), data, offset);
        pic32mx3_cm1con_after_write(s);
        return;
    case CM2CON:
    case CM2CONCLR:
    case CM2CONSET:
    case CM2CONINV:
        *namep = "CM2CON";
        VALUE(CM2CON) = write_op(VALUE(CM2CON), data, offset);
        pic32mx3_cm2con_after_write(s);
        return;
    WRITEOP(CM3CON); return;
    WRITEOP(CMSTAT); return;

    /*-------------------------------------------------------------------------
     * Real-Time Clock and Calendar.
     */
    WRITEOP(RTCCON); return;
    WRITEOP(RTCALRM); return;
    WRITEOP(RTCTIME); return;
    WRITEOP(RTCDATE); return;
    WRITEOP(ALRMTIME); return;
    WRITEOP(ALRMDATE); return;

    /*-------------------------------------------------------------------------
     * Timers T1-T5.
     */
    case T1CON:
    case T1CONCLR:
    case T1CONSET:
    case T1CONINV:
        *namep = "T1CON";
        VALUE(T1CON) = write_op(VALUE(T1CON), data, offset);
        pic32mx3_tmr_recompute(s, 0);
        return;
    case TMR1:
    case TMR1CLR:
    case TMR1SET:
    case TMR1INV:
        *namep = "TMR1";
        VALUE(TMR1) = write_op(VALUE(TMR1), data, offset);
        pic32mx3_tmr_recompute(s, 0);
        return;
    case PR1:
    case PR1CLR:
    case PR1SET:
    case PR1INV:
        *namep = "PR1";
        VALUE(PR1) = write_op(VALUE(PR1), data, offset);
        pic32mx3_tmr_recompute(s, 0);
        return;
    case T2CON:
    case T2CONCLR:
    case T2CONSET:
    case T2CONINV:
        *namep = "T2CON";
        VALUE(T2CON) = write_op(VALUE(T2CON), data, offset);
        pic32mx3_tmr_recompute(s, 1);
        return;
    case TMR2:
    case TMR2CLR:
    case TMR2SET:
    case TMR2INV:
        *namep = "TMR2";
        VALUE(TMR2) = write_op(VALUE(TMR2), data, offset);
        pic32mx3_tmr_recompute(s, 1);
        return;
    case PR2:
    case PR2CLR:
    case PR2SET:
    case PR2INV:
        *namep = "PR2";
        VALUE(PR2) = write_op(VALUE(PR2), data, offset);
        pic32mx3_tmr_recompute(s, 1);
        return;
    case T3CON:
    case T3CONCLR:
    case T3CONSET:
    case T3CONINV:
        *namep = "T3CON";
        VALUE(T3CON) = write_op(VALUE(T3CON), data, offset);
        pic32mx3_tmr_recompute(s, 2);
        return;
    case TMR3:
    case TMR3CLR:
    case TMR3SET:
    case TMR3INV:
        *namep = "TMR3";
        VALUE(TMR3) = write_op(VALUE(TMR3), data, offset);
        pic32mx3_tmr_recompute(s, 2);
        return;
    case PR3:
    case PR3CLR:
    case PR3SET:
    case PR3INV:
        *namep = "PR3";
        VALUE(PR3) = write_op(VALUE(PR3), data, offset);
        pic32mx3_tmr_recompute(s, 2);
        return;
    case T4CON:
    case T4CONCLR:
    case T4CONSET:
    case T4CONINV:
        *namep = "T4CON";
        VALUE(T4CON) = write_op(VALUE(T4CON), data, offset);
        pic32mx3_tmr_recompute(s, 3);
        return;
    case TMR4:
    case TMR4CLR:
    case TMR4SET:
    case TMR4INV:
        *namep = "TMR4";
        VALUE(TMR4) = write_op(VALUE(TMR4), data, offset);
        pic32mx3_tmr_recompute(s, 3);
        return;
    case PR4:
    case PR4CLR:
    case PR4SET:
    case PR4INV:
        *namep = "PR4";
        VALUE(PR4) = write_op(VALUE(PR4), data, offset);
        pic32mx3_tmr_recompute(s, 3);
        return;
    case T5CON:
    case T5CONCLR:
    case T5CONSET:
    case T5CONINV:
        *namep = "T5CON";
        VALUE(T5CON) = write_op(VALUE(T5CON), data, offset);
        pic32mx3_tmr_recompute(s, 4);
        return;
    case TMR5:
    case TMR5CLR:
    case TMR5SET:
    case TMR5INV:
        *namep = "TMR5";
        VALUE(TMR5) = write_op(VALUE(TMR5), data, offset);
        pic32mx3_tmr_recompute(s, 4);
        return;
    case PR5:
    case PR5CLR:
    case PR5SET:
    case PR5INV:
        *namep = "PR5";
        VALUE(PR5) = write_op(VALUE(PR5), data, offset);
        pic32mx3_tmr_recompute(s, 4);
        return;

    /*-------------------------------------------------------------------------
     * Input Capture IC1-IC5.
     */
    case IC1CON:
    case IC1CONCLR:
    case IC1CONSET:
    case IC1CONINV:
        *namep = "IC1CON";
        VALUE(IC1CON) = write_op(VALUE(IC1CON), data, offset);
        pic32mx3_ic1con_after_write(s, VALUE(IC1CON));
        return;
    WRITEOP(IC2CON); return;
    WRITEOP(IC3CON); return;
    WRITEOP(IC4CON); return;
    WRITEOP(IC5CON); return;

    /*-------------------------------------------------------------------------
     * Output Compare OC1-OC5.
     */
    WRITEOP(OC1CON); return;
    WRITEOP(OC1R); return;
    WRITEOP(OC1RS); return;
    WRITEOP(OC2CON); return;
    WRITEOP(OC2R); return;
    WRITEOP(OC2RS); return;
    WRITEOP(OC3CON); return;
    WRITEOP(OC3R); return;
    WRITEOP(OC3RS); return;
    WRITEOP(OC4CON); return;
    WRITEOP(OC4R); return;
    WRITEOP(OC4RS); return;
    WRITEOP(OC5CON); return;
    WRITEOP(OC5R); return;
    WRITEOP(OC5RS); return;

    /*-------------------------------------------------------------------------
     * I2C 1.
     */
    WRITEOP(I2C1CON); return;
    WRITEOPR(I2C1STAT, PIC32_I2CSTAT_TBF); return;  // TBF is read-only
    WRITEOP(I2C1ADD); return;
    WRITEOP(I2C1MSK); return;
    WRITEOP(I2C1BRG); return;
    case I2C1TRN:
    case I2C1TRNCLR:
    case I2C1TRNSET:
    case I2C1TRNINV:
        *namep = "I2C1TRN";
        VALUE(I2C1TRN) = write_op(VALUE(I2C1TRN), data, offset);
        pic32mx3_i2c_trn_write(s, 0, VALUE(I2C1TRN));
        return;
    READONLY(I2C1RCV);          // Receive: read-only

    /*-------------------------------------------------------------------------
     * I2C 2.
     */
    WRITEOP(I2C2CON); return;
    WRITEOPR(I2C2STAT, PIC32_I2CSTAT_TBF); return;  // TBF is read-only
    WRITEOP(I2C2ADD); return;
    WRITEOP(I2C2MSK); return;
    WRITEOP(I2C2BRG); return;
    case I2C2TRN:
    case I2C2TRNCLR:
    case I2C2TRNSET:
    case I2C2TRNINV:
        *namep = "I2C2TRN";
        VALUE(I2C2TRN) = write_op(VALUE(I2C2TRN), data, offset);
        pic32mx3_i2c_trn_write(s, 1, VALUE(I2C2TRN));
        return;
    READONLY(I2C2RCV);          // Receive: read-only

    /*-------------------------------------------------------------------------
     * Parallel Master Port.
     */
    WRITEOP(PMCON); return;
    WRITEOP(PMMODE); return;
    WRITEOP(PMADDR); return;
    case PMDOUT: *namep = "PMDOUT"; goto op_PMDOUT;
    case PMDOUTCLR: *namep = "PMDOUTCLR"; goto op_PMDOUT;
    case PMDOUTSET: *namep = "PMDOUTSET"; goto op_PMDOUT;
    case PMDOUTINV: *namep = "PMDOUTINV"; op_PMDOUT: {
            unsigned prev = VALUE(PMDOUT);

