pratanczuk/qemu/hw/mips/mips_pic32mx3.c
    /*
     * Map the flash memory.
     */
    memory_region_init_ram(boot_mem, NULL, "boot.flash", BOOT_FLASH_SIZE, &error_abort);
    memory_region_init_ram(prog_mem, NULL, "prog.flash", PROGRAM_FLASH_SIZE, &error_abort);

    /* Load a Flash memory image. */
    if (! machine->kernel_filename) {
        error_report("No -kernel argument was specified.");
        exit(1);
    }
    prog_ptr = memory_region_get_ram_ptr(prog_mem);
    boot_ptr = memory_region_get_ram_ptr(boot_mem);
    pic32mx3_nvm_bind_flash(s, (uint8_t *)prog_ptr, (uint8_t *)boot_ptr,
                            PROGRAM_FLASH_SIZE, BOOT_FLASH_SIZE,
                            PROGRAM_FLASH_START, BOOT_FLASH_START);
    /*
     * Optional persisted images (-global mips-pic32mx3.prog-flash=…): erased
     * (0xFF) then file contents; -kernel / ELF overwrites firmware regions.
     */
    pic32mx3_flash_load_images(s);

    /* Map flash into address space before ELF loading (rom infrastructure
     * writes via cpu_physical_memory_write_rom which requires mapped regions). */
    memory_region_set_readonly(boot_mem, true);
    memory_region_set_readonly(prog_mem, true);
    memory_region_add_subregion(system_memory, BOOT_FLASH_START, boot_mem);
    memory_region_add_subregion(system_memory, PROGRAM_FLASH_START, prog_mem);

    /* Detect ELF magic to choose the loading path. */
    {
        FILE *fp = fopen(machine->kernel_filename, "rb");
        unsigned char magic[4] = {0};
        if (fp) {
            fread(magic, 1, 4, fp);
            fclose(fp);
        }
        if (magic[0] == 0x7f && magic[1] == 'E' &&
            magic[2] == 'L'  && magic[3] == 'F')
        {
            /* ELF firmware image: load via QEMU rom infrastructure. */
            uint64_t elf_entry;
            const int big_endian = 0;   /* MIPS32 little-endian */
            const int clear_lsb = 0;    /* Not ARM Thumb mode */
            int elf_size = load_elf(machine->kernel_filename,
                                    cpu_mips_kseg0_to_phys, NULL,
                                    &elf_entry, NULL, NULL,
                                    big_endian,
                                    EM_MIPS,
                                    clear_lsb);
            if (elf_size < 0) {
                error_report("Failed to load ELF firmware '%s' (error %d)",
                             machine->kernel_filename, elf_size);
                exit(1);
            }
            printf("Firmware: ELF, %d bytes, entry 0x%08llx\n",
                   elf_size, (unsigned long long) elf_entry);
            if (bios_name) {
                /* Optional boot ROM as hex/srec alongside ELF kernel. */
                pic32_load_hex_file(bios_name, store_byte);
            }
        } else {
            /* Intel HEX or Motorola SREC firmware image. */
            if (bios_name)
                pic32_load_hex_file(bios_name, store_byte);
            pic32_load_hex_file(machine->kernel_filename, store_byte);
        }
    }

    /* Init internal devices */
    s->irq_raise = irq_raise;
    s->irq_clear = irq_clear;
    qemu_register_reset(main_cpu_reset, cpu);

    /* Setup interrupt controller in EIC mode. */
    env->CP0_Config3 |= 1 << CP0C3_VEIC;
    cpu_mips_irq_init_cpu(env);
    env->eic_timer_irq = pic32_timer_irq;
    env->eic_soft_irq = pic32_soft_irq;
    env->eic_context = s;

    /* CPU runs at 80MHz.
     * Count register increases at half this rate. */
    cpu_mips_clock_init(env, 40*1000*1000);

    /*
     * Initialize board-specific parameters.
     */
    int cs0_port, cs0_pin, cs1_port, cs1_pin;
    switch (board_type) {
    default:
    case BOARD_MX350_GENERIC:
        BOOTMEM(DEVCFG0) = 0xffffff7f;
        BOOTMEM(DEVCFG1) = 0x7f743cb9;     // FRC+PLL, PBDIV=1, WDT off
        BOOTMEM(DEVCFG2) = 0xfff9b11a;     // FPLLIDIV=2, FPLLMUL=20, FPLLODIV=1 -> 80MHz
        BOOTMEM(DEVCFG3) = 0xffff0000;
        VALUE(DEVID)     = 0x0516D053;      // PIC32MX350F256H rev A3
        VALUE(OSCCON)    = 0x00001120;      // FRC+PLL, PBDIV=1, 80MHz
        s->sdcard_spi_port = 1;             // SD card at SPI2,
        cs0_port = 0;  cs0_pin = 1;         // select0 at B1,
        cs1_port = -1; cs1_pin = -1;        // select1 not available
        break;
    }

    /*
     * UARTs: U1/U2/U3.
     * Host mapping for pic32mx3-generic:
     *   -serial #0 -> UART3 (115200; guest PPS for TX/RX pins is not applied to the char backend.)
     *   -serial #1 -> UART1 (e.g. debug on RE5/RF2)
     *   -serial #2 -> UART2 (optional)
     * Use "-serial null -serial stdio" if the image uses UART1 as console.
     * Debug: QEMU_PIC32_TRACE_UART=1 logs each UxTXREG write (unit index).
     * Flash persistence (NVS across runs):
     *   -global mips-pic32mx3.prog-flash=/path/to/prog.bin
     *   -global mips-pic32mx3.boot-flash=/path/to/boot.bin   (optional; board
     *     DEVCFG words are still written after load — see pic32mx3_nvm.c)
     */
    /* Base IRQ = IFS1 UxEIF bit index (see irq_to_vector): U1 38, U2 56, U3 62 (+2 = U3TX in IFS2). */
    pic32_uart_init(s, 0, 38, U1STA, U1MODE);
    pic32_uart_init(s, 1, 56, U2STA, U2MODE);
    pic32_uart_init(s, 2, 62, U3STA, U3MODE);
    if (serial_hds[0]) {
        s->uart[0].chr = NULL;
        pic32_uart_attach_chr(s, 2, serial_hds[0]);
    }
    if (serial_hds[1]) {
        s->uart[1].chr = NULL;
        pic32_uart_attach_chr(s, 0, serial_hds[1]);
    }
    if (serial_hds[2]) {
        pic32_uart_attach_chr(s, 1, serial_hds[2]);
    }

    /* SPIs: MX350F256H has SPI1, SPI2, SPI3 */
    pic32_spi_init(s, 0, PIC32_IRQ_SPI1E, SPI1CON, SPI1STAT);
    pic32_spi_init(s, 1, PIC32_IRQ_SPI2E, SPI2CON, SPI2STAT);
    pic32_spi_init(s, 2, PIC32_IRQ_SPI3E, SPI3CON, SPI3STAT);

    /*
     * Load SD card images.
     * Use options:
     *      -sd filename
     * or   -hda filename
     * and  -hdb filename
     */
    const char *sd0_file = 0, *sd1_file = 0;
    DriveInfo *dinfo = drive_get(IF_IDE, 0, 0);
    if (dinfo) {
        sd0_file = qemu_opt_get(dinfo->opts, "file");
        dinfo->is_default = 1;

        dinfo = drive_get(IF_IDE, 0, 1);
        if (dinfo) {
            sd1_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    if (! sd0_file) {
        dinfo = drive_get(IF_SD, 0, 0);
        if (dinfo) {
            sd0_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    pic32_sdcard_init(s, 0, "sd0", sd0_file, cs0_port, cs0_pin);
    pic32_sdcard_init(s, 1, "sd1", sd1_file, cs1_port, cs1_pin);

    io_reset(s);

    {
        int ti;

        for (ti = 0; ti < PIC32_MX3_N_TMRS; ti++) {
            s->tmr_opaque[ti].mcu = s;
            s->tmr_opaque[ti].idx = ti;
            if (!s->tmr_timer[ti]) {
                s->tmr_timer[ti] = timer_new_ns(pic32mx3_tmr3_clock_type(),
                                                pic32mx3_tmr_cb,
                                                &s->tmr_opaque[ti]);
            }
        }
    }

    pic32_sdcard_reset(s);
    pic32mx3_flash_register_exit_save(s);
    pic32_pass_signal_chars();
}

static void pic32_init_generic(MachineState *machine)
{
    pic32_init(machine, BOARD_MX350_GENERIC);
}

static int pic32_sysbus_device_init(SysBusDevice *sysbusdev)
{
    return 0;
}

static Property pic32_properties[] = {
    DEFINE_PROP_STRING("prog-flash", pic32_t, prog_flash_path),
    DEFINE_PROP_STRING("boot-flash", pic32_t, boot_flash_path),
    DEFINE_PROP_END_OF_LIST(),
};

static void pic32_class_init(ObjectClass *klass, void *data)
{
    SysBusDeviceClass *k = SYS_BUS_DEVICE_CLASS(klass);
    DeviceClass *dc = DEVICE_CLASS(klass);

    k->init = pic32_sysbus_device_init;
    dc->props = pic32_properties;
}

static const TypeInfo pic32_device = {
    .name          = TYPE_MIPS_PIC32,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(pic32_t),
    .class_init    = pic32_class_init,
};

static void pic32_register_types(void)
{
    type_register_static(&pic32_device);
}

static QEMUMachine pic32_board[1] = {
    {
        .name       = "pic32mx3-generic",
        .desc       = "PIC32MX350F256H microcontroller (generic board)",
        .init       = pic32_init_generic,
        .max_cpus   = 1,
    },
};

static void pic32_machine_init(void)
{
    qemu_register_machine(&pic32_board[0]);
}

type_init(pic32_register_types)
machine_init(pic32_machine_init);

#endif /* !TARGET_MIPS64 && !TARGET_WORDS_BIGENDIAN */
